# pandas 入门

In [17]:
import pandas as pd
import numpy as np

## 5.1 数据结构
### 5.1.1 Series
一维数组对象，包含值-values属性和索引-index属性（数据标签）

In [18]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [19]:
obj.values

array([ 4,  7, -5,  3])

In [20]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [21]:
## 创建一个索引序列，给每个数据打上标签
obj2 = pd.Series([4,7,-5,3],index = ['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [22]:
## 可以像excel一样，给每列名字
obj.name = 'int'
obj.index.name = 'lable'
obj

lable
0    4
1    7
2   -5
3    3
Name: int, dtype: int64

In [23]:
## 索引可以按位置赋值改变
obj.index = ['a','b','c','d']
obj

a    4
b    7
c   -5
d    3
Name: int, dtype: int64

In [24]:
## 进行np操作后，标签和数据仍对应
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [25]:
## 类似字典可以使用in
'a' in obj2

True

#### 字典生成Series

In [26]:
sdata = {'Ohio':35000,'Texas':71000,'Oregon':16000,"Utah":5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [27]:
## 用字典生成时，可以指定index的顺序
states = ['California','Ohio','Oregon','Texas']
obj4 = pd.Series(sdata,index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

#### isnull notnull检查数据缺失

In [28]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

#### 自动对齐

In [29]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [30]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [31]:
## 按索引对齐，没有值则补NaN
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

### 5.1.2 DataFrame
#### 用包含长度相同的numpy数组的字典生成DataFrame

In [34]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

## 生成df时，可以指定列的顺序，如果指定了不存在的所以，用NaN填充
frame = pd.DataFrame(data,columns = ('year','state','pop','debt'))
frame

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

#### head选取dataframe前5行

In [35]:
frame.head()

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN

#### 检索行的两种方式 [] 或者.

In [36]:
frame['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [37]:
frame.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

#### loc 用标签检索列

In [38]:
frame.loc[3]

year       2001
state    Nevada
pop         2.4
debt        NaN
Name: 3, dtype: object

#### 查询出结果后可赋值，注意长度匹配

In [39]:
frame['debt'] = 16.5
frame

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [41]:
frame['debt'] = range(6)
frame

   year   state  pop  debt
0  2000    Ohio  1.5     0
1  2001    Ohio  1.7     1
2  2002    Ohio  3.6     2
3  2001  Nevada  2.4     3
4  2002  Nevada  2.9     4
5  2003  Nevada  3.2     5